export const state = () => ({
    dialog: {
        isShow: false,
        title: '',
        message: '',
    },
    register: {
        firstname: '',
        lastname: '',
        gender: 1,
        birthday: null,
        email: '',
        phone: '',
        house_no: '',
        village_no: '',
        village: '',
        province: '',
        district: '',
        subdistrict: '',
    },
    line: {
        pictureUrl: '',
        displayName: '',
        userId: ''
    },
    data: {
        sitthi: [
            {
                id: 1,
                code: '110009',
                name: 'กรมธรรม์ มอบรัก 1/1 หรือวันละบาท',
                type: 'เสียชีวิต',
                cost: '30 บาทต่อเดือน',
                img_type: 'dead.png',
                img_author: 'author_1.png',
                author: 'ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร (ธ.ก.ส.)',
                detail: [
                    {
                        id: 1,
                        title: 'ผู้กู้ได้รับเงินกู้สูงสุด 1,000,000 บาท'
                    }, {
                        id: 2,
                        title: 'คู่สมรสผู้กู้ได้รับสูงสุด 200,000 บาท และกรณีที่เสียชีวิตจากอุบัติเหตุรับเพิ่ม อีก 100% ของเงินทุนสงเคราะห์'
                    }
                ],
                condition: [
                    {
                        id: 1,
                        title: 'อายุ 20-60 ปีบริบูรณ์'
                    }, {
                        id: 2,
                        title: 'อาชีพเกษตรกร'
                    }, {
                        id: 3,
                        title: 'เป็นสมาชิกหรือเป็นลูกค้าของธนาคารเพื่อการเกษตรหรือครอบครัวของสมาชิก'
                    }
                ],
                tool: 'เอกสารแสดงข้อมูลผลิตภัณฑ์สงเคราะห์ชีวิต กรมธรรม์ มอบรัก 1/1'
            },
            {
                id: 2,
                code: '110082',
                name: 'ประกันสังคม มาตรา 39',
                type: 'คลอดบุตร',
                cost: '432 บาทต่อเดือน',
                img_type: 'babe.png',
                img_author: 'author_2.png',
                author: 'สำนักงานประกันสังคม',
                detail: [
                    {
                        id: 3,
                        title: 'ค่าคลอดบุตรเหมาจ่าย 15000 บาท'
                    }, {
                        id: 4,
                        title: 'เบิกค่าตรวจครรภ์ได้สูงสุด 1500 บาท'
                    }, {
                        id: 5,
                        title: 'รับเงินสงเคราะห์การหยุดงานเพื่อคลอดบุตร 50% ของค่าจ้างเฉลี่ยเป็น 90 วัน'
                    }, {
                        id: 6,
                        title: 'กรณีเงินสงเคราะห์การหยุดงานเพื่อคลอดบุตรสามารถเบิกได้สูงสุดไม่เกิน 2 ครั้ง'
                    }
                ],
                condition: [
                    {
                        id: 4,
                        title: 'หญิงอายุ 18-55 ปี'
                    }, {
                        id: 5,
                        title: 'เคยเป็นผู้ประกันตนตามประกันสังคม ม.33'
                    }, {
                        id: 6,
                        title: 'จ่ายเงินสมทบ ม. 39 มาแล้วไม่ต่ำกว่า 3 เดือน'
                    }
                ],
                tool: 'รวมสิทธิประกันสังคมที่ผู้ประกันตนทุกมาตราต้องรู้ ครบจบในที่เดียว! By FINNOMENA'
            },
            {
                id: 3,
                code: '110089',
                name: 'ประกันสังคม มาตรา 39',
                type: 'สงเคราะห์บุตร',
                cost: '432 บาทต่อเดือน',
                img_type: 'family.png',
                img_author: 'author_2.png',
                author: 'สำนักงานประกันสังคม',
                detail: [
                    {
                        id: 7,
                        title: 'เงินสงเคราะห์บุตรเหมาจ่าย เดือนละ 600 บาท ต่อบุตรหนึ่งคน'
                    }, {
                        id: 8,
                        title: 'บุตรมีอายุตั้งแต่แรกเกิดจนถึงอายุไม่เกิน 6 ปีบริบูรณ์'
                    }, {
                        id: 9,
                        title: 'ครั้งละไม่เกิน 3 คน'
                    }
                ],
                condition: [
                    {
                        id: 7,
                        title: 'เคยเป็นผู้ประกันตนตามประกันสังคม ม.33'
                    }, {
                        id: 8,
                        title: 'จ่ายเงินสมทบมาแล้วไม่ต่ำกว่า 12 เดือนภายในระยะเวลา 36 เดือนก่อนเดือนที่มีสิทธิได้รับประโยชน์ทดแทน'
                    }
                ],
                tool: 'รวมสิทธิประกันสังคมที่ผู้ประกันตนทุกมาตราต้องรู้ ครบจบในที่เดียว! BY FINNOMENA'
            },
            {
                id: 4,
                code: '110071',
                name: 'ประกันสังคม (มาตรา 39)',
                type: 'เจ็บป่วย',
                cost: '432 บาทต่อเดือน',
                img_type: 'sick.png',
                img_author: 'author_2.png',
                author: 'สำนักงานประกันสังคม',
                detail: [
                    {
                        id: 10,
                        title: 'กรณีเจ็บป่วยปกติ สามารถเข้ารับการรักษาพยาบาลในสถาน พยาบาลตามสิทธิ หรือเครือข่ายของสถานพยาบาลนั้นได้ฟรี โดยไม่ต้องสำรองค่าใช้จ่ายทั้งผู้ป่วยนอก (OPD) และผู้ป่วยใน (IPD)'
                    }
                ],
                condition: [
                    {
                        id: 9,
                        title: 'อายุ 18 - 55 ปีบริบูรณ์'
                    }, {
                        id: 10,
                        title: 'เคยเป็นผู้ประกันตนตามประกันสังคม ม.33'
                    }
                ],
                tool: 'รวมสิทธิประกันสังคมที่ผู้ประกันตนทุกมาตราต้องรู้ ครบจบในที่เดียว! BY FINNOMENA'
            },
            {
                id: 5,
                code: '110095',
                name: 'การให้บริการกู้ยืมเงินทุนประกอบอาชีพจากกองทุนผู้สูงอายุ',
                type: 'ว่างงาน/ส่งเสริมอาชีพ',
                cost: '432 บาทต่อเดือน',
                img_type: 'kid_rich.png',
                img_author: 'author_3.png',
                author: 'กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์',
                detail: [
                    {
                        id: 11,
                        title: 'กู้ยืมรายบุคคลรายละไม่เกิน 30,000 บาท'
                    }, {
                        id: 12,
                        title: 'กู้ยืมรายกลุ่ม กลุ่มละไม่น้อยกว่า 5 คน กลุ่มละไม่เกิน 100,000 บาท'
                    }, {
                        id: 13,
                        title: 'ชำระคืนรายงวดทุกเดือน'
                    }, {
                        id: 14,
                        title: 'ระยะเวลา 3 ปี โดยไม่คิดดอกเบี้ย'
                    }
                ],
                condition: [
                    {
                        id: 11,
                        title: 'อายุ 60 ปีขึ้นไป '
                    }, {
                        id: 12,
                        title: 'สามารถประกอบอาชีพได้และมีแผน งานหรือโครงการประกอบอาชีพที่เหมาะสม'
                    }
                ],
                tool: 'การให้บริการกู้ยืมเงินทุนประกอบอาชีพโดยกรมกิจการผู้สูงอายุ'
            },
            {
                id: 6,
                code: '110107',
                name: 'ประกันสังคม มาตรา 39',
                type: 'ทุพพลภาพ',
                cost: '432 บาทต่อเดือน',
                img_type: 'kid_sick.png',
                img_author: 'author_2.png',
                author: 'สำนักงานประกันสังคม',
                detail: [
                    {
                        id: 15,
                        title: 'เจ็บป่วยปกติสถานพยาบาลเอกชนกรณีผู้ป่วยนอกไม่เกิน เดือนละ 2,000 บาท'
                    }
                ],
                condition: [
                    {
                        id: 13,
                        title: 'อายุ 18 - 55 ปี'
                    }, {
                        id: 14,
                        title: 'จ่ายเงินสมทบมาแล้วไม่ต่ำกว่า 3 เดือน'
                    }, {
                        id: 15,
                        title: 'สูญเสียอวัยวะหรือสูญเสียสมรรถภาพของอวัยวะหรือร่างกาย'
                    }, {
                        id: 16,
                        title: 'หรือสูญเสียภาวะปกติของจิตใจจนไม่สามารถทำงานได้'
                    }
                ],
                tool: 'รวมสิทธิประกันสังคมที่ผู้ประกันตนทุกมาตราต้องรู้ ครบจบในที่เดียว! BY FINNOMENA'
            },
            {
                id: 7,
                code: '110052',
                name: 'ประกันสังคม มาตรา 39',
                type: 'ชราภาพ',
                cost: '432 บาทต่อเดือน',
                img_type: 'dead.png',
                img_author: 'author_1.png',
                author: 'สำนักงานประกันสังคม',
                detail: [
                    {
                        id: 16,
                        title: 'ได้รับเงินบำเหน็จชราภาพเท่ากับเงินที่ผู้ประกันตนจ่ายไป'
                    }
                ],
                condition: [
                    {
                        id: 17,
                        title: 'อายุ 55 ปี บริบูรณ์'
                    }, {
                        id: 18,
                        title: 'เคยเป็นผู้ประกันตนตามประกันสังคม ม.33'
                    }, {
                        id: 19,
                        title: 'จ่ายเงินสมทบต่ำกว่า 12 เดือน'
                    }
                ],
                tool: 'รวมสิทธิประกันสังคมที่ผู้ประกันตนทุกมาตราต้องรู้ ครบจบในที่เดียว! BY FINNOMENA'
            }
        ]
    }
})

export const getters = {
    getRegister(state) {
        return state.register
    },
    getDialog(state) {
        return state.dialog
    },
    getLine(state) {
        return state.line
    },
    getSetthi(state) {
        return state.data.sitthi
    }
}

export const mutations = {
    SET_REGISTER(state, data) {
        state.register = {
            ...state.register,
            ...data
        }
    },
    SET_DIALOG(state, data) {
        state.dialog = {
            ...state.dialog,
            ...data
        }
    },
    SET_LINE(state, data) {
        state.line = {
            ...state.line,
            ...data
        }
    }
}

export const actions = {
    setRegister({ commit }, data) {
        commit('SET_REGISTER', data)
    },
    setDialog({ commit }, data) {
        commit('SET_DIALOG', data)
    },
    setLine({ commit }, data) {
        commit('SET_LINE', data)
    }
}